[
  {
    "text": "Hoda Maalouf\nProfessor\nChairperson, Department of Computer Science\nO: FNAS 1.18\nT: 09.208000, Ext. 2117\nE: hmaalouf@ndu.edu.lb",
    "keywords": ["Hoda Maalouf contact", "Professor NDU", "Computer Science department", "FNAS", "NDU professor email", "Hoda Maalouf office location", "phone number", "email address", "office number"]
  },
  {
    "text": "Hoda Maalouf holds a Ph.D. in Communication Engineering from Imperial College, London. She worked at Imperial College, between 1990 and 1995 as a researcher on the Commission of the European Communities Advanced Transport Telematics DRIVE I CIDER and DRIVE II FRAME projects. She joined Notre Dame University in 1999 and chaired the Department of Computer Science between 2001 and 2006, and from 2010 till now. Her research interests include performance evaluation and modeling of fixed, wireless and hybrid networks. In particular, she concentrated on the analytical study of wireless sensor networks, delay/disruptive tolerant networks, multi-stage hybrid networks, distributed database systems and real-time systems",
    "keywords": ["Hoda Maalouf biography", "Communication Engineering PhD", "Imperial College London", "European Communities projects", "DRIVE I CIDER", "DRIVE II FRAME", "Notre Dame University", "Computer Science Chairperson", "research interests", "performance evaluation", "network modeling", "wireless sensor networks", "distributed database systems", "real-time systems"]
  },
  {
    "text": "Moussa, A., & Maalouf, H. (2009). Performance Optimization in Structured Wireless Sensor Networks.\nInternational Arab Journal Information Technology, 6(5), 451-456.",
    "keywords": ["Hoda Maalouf publication", "journal article", "regional journal", "Performance Optimization", "Wireless Sensor Networks", "International Arab Journal Information Technology", "Moussa A.", "2009"]
  },
  {
    "text": "Maalouf, H.W., & Gurcan, M.K. (2002). Minimization of the update response time in a distributed database system.\nPerformance Evaluation, Elsevier, 50(4), 245-266.",
    "keywords": ["Hoda Maalouf publication", "journal article", "international journal", "distributed database system", "update response time", "Performance Evaluation", "Elsevier", "Gurcan M.K.", "2002"]
  },
  {
    "text": "Akiki, P., & Maalouf, H.W. (2007). Extending Relational Database Management Systems to support Spatial Data.\nCurrent Trends in the Theory and Applications of Computer Science, 2007. CTTACS '07. NDU Press.\nSaab, S., & Maalouf, H.W. (2007). Data MULE Aggregation Protocol for Wireless Sensor Networks. Current\nTrends in the Theory and Applications of Computer Science, 2007. CTTACS '07. NDU Press.",
    "keywords": ["Hoda Maalouf publication", "conference proceeding", "local conference", "Relational Database Management Systems", "Spatial Data", "CTTACS '07", "NDU Press", "Akiki P.", "Saab S.", "Data MULE", "Wireless Sensor Networks", "2007"]
  },
  {
    "text": "Katerji, W., & Maalouf, H.W. (2011). GIS Based Deployment Strategies of Wireless Sensors Networks for Forest Fire Surveillance. In the 5th International Conference on Information Technology, Jordan.",
    "keywords": ["Hoda Maalouf publication", "conference proceeding", "regional conference", "GIS Based Deployment Strategies", "Wireless Sensors Networks", "Forest Fire Surveillance", "Information Technology conference", "Jordan", "Katerji W.", "2011"]
  },
  {
    "text": "Akiki, P. A., & Maalouf, H. W. (2014). A Real-Time Merging Process for Multi-view Video Coding. In 2014 17th IEEE Mediterranean Electrotechnical Conference (MELECON) (pp. 163–169). IEEE Press.\nAkiki, P. A., & Maalouf, H. W. (2011). A Two-Stage Encoding Scheme for Holographic Data Transmission. In 2011 5th FTRA International Conference on Multimedia and Ubiquitous Engineering (MUE) (pp. 138–142).",
    "keywords": ["Hoda Maalouf publication", "conference proceeding", "international conference", "Real-Time Merging Process", "Multi-view Video Coding", "MELECON", "IEEE", "Akiki P.A.", "2014", "Two-Stage Encoding Scheme", "Holographic Data Transmission", "FTRA", "MUE", "2011"]
  },
  {
    "text": "Maalouf, H. W. (2009). Managing Trade-Offs between Information Loss and Latency in Real-Time Distributed Systems. In International Conference for Internet Technology and Secured Transactions, 2009. ICITST 2009 (pp. 1-6). IEEE Press.\nMaalouf, H. W., & Aakvaag, N. D. (2008). Packet resequencing and aggregation in wireless ad hoc networks. In I EEE International Symposium on Wireless Communication Systems. 2008. ISWCS '08 (pp. 672–676). IEEE Press.\nMaalouf, H. W. (2008). The Modeling of Packet Disordering in Multi-stage Wireless Sensor Networks. Proceedings of 5th International Symposium on Mechatronics and Its Applications, 2008. ISMA 2008 (pp. 1–5). IEEE Press.",
    "keywords": ["Hoda Maalouf publication", "conference proceeding", "international conference", "Trade-Offs", "Information Loss", "Latency", "Real-Time Distributed Systems", "ICITST 2009", "2009", "Packet resequencing", "wireless ad hoc networks", "ISWCS '08", "Aakvaag N.D.", "2008", "Packet Disordering Modeling", "Wireless Sensor Networks", "ISMA 2008"]
  },
  {
    "text": "Chelala, M. G., & Maalouf, H. (2007). Performance Evaluation of Video Stream Transport over 2-Stage Hybrid EEE International Conference on Signal Processing and Communications, 2007. ICSPC 2007 (pp. 404–407). IEEE Press.\nLewis, N. H., Maalouf, H. W., Gurcan, M. K., & Jones, M. C. (1993). The Impact of User Requirements on the System Design and Architecture of Hazardous Goods Monitoring Systems. Proceedings of DRIVE-II Technical Days, Commission of the European Communities, Brussels, Belgium.",
    "keywords": ["Hoda Maalouf publication", "conference proceeding", "international conference", "Performance Evaluation", "Video Stream Transport", "ICSPC 2007", "IEEE", "Chelala M.G.", "2007", "User Requirements", "System Design", "Hazardous Goods Monitoring Systems", "DRIVE-II", "European Communities", "Lewis N.H.", "Gurcan M.K.", "Jones M.C.", "1993"]
  },
  {
    "text": "Siranossian, A. S., & Maalouf, H. W. (2013). REsilient Double WEighted TruST Based (REDWEST) WSN Using SAX. In Sensor Systems and Software (pp. 17–33). Springer International Publishing.\nAkiki, P., & Maalouf, H. (2009). Incorporating Spatial Data into Enterprise Applications. In Information Systems Development Towards a Service Provision Society (pp. 695–704). Springer US.",
    "keywords": ["Hoda Maalouf publication", "book chapter", "international book", "REDWEST WSN", "SAX", "Sensor Systems and Software", "Siranossian A.S.", "2013", "Spatial Data", "Enterprise Applications", "Information Systems Development", "Akiki P.", "Springer", "2009"]
  },
  {
    "text": "Co-author of \"Energize your Leadership” book, CreateSpace-Amazon, USA. http://www.energizeyourleadership.net/",
    "keywords": ["Hoda Maalouf creative work", "book", "Energize your Leadership", "co-author", "CreateSpace-Amazon", "leadership book", "website link"]
  },
  {
    "text": "Vice Chair of IEEE Computer Society, Lebanon Chapter (Region 8)",
    "keywords": ["Hoda Maalouf recognition", "esteemed indicator", "IEEE Computer Society", "Lebanon Chapter", "Vice Chair", "Region 8"]
  },
  {
    "text": "Additional info can be found at: http://www.hodamaalouf.com/",
    "keywords": ["Hoda Maalouf CV", "resume", "website", "link", "personal website"]
  },
  {
    "text": "Nazir Hawi, Ph.D.\nProfessor\nO: FNAS 1.46\nT: 09 218 950, Ext. 2361\nE: nhawi@ndu.edu.lb",
    "keywords": ["Nazir Hawi contact", "Professor NDU", "FNAS contact", "faculty contact", "NDU professor email", "Nazir Hawi office location", "phone number", "email address", "office number"]
  },
  {
    "text": "Dr. Nazir Hawi holds the position of Full Professor within the Faculty of Natural and Applied Sciences at Notre Dame University-Louaize. He is the co-founder of the Institute of Internet and Technology Addiction at NDU and served as the Chair of its Board of Directors. Over the past four consecutive years, he has consistently ranked among the top 2% of scientists worldwide worldwide for five consecutive years based on Scopus data, compiled by scientists from Stanford University.\nIn his role, Dr. Hawi instructs a diverse range of courses, including Advanced Data Science, Information Presentation and Visualization, Advanced Programming Technologies, Advanced Software Development, Senior Study, Advanced Programming using Java, Systems Analysis and Design, Applied Operating Systems, Web Design, Program Design and Data Abstraction, Object-Oriented Design, Mobile App Development, Computer Programming II & I, and Computers and Their Use.\nHis primary research interests encompass the field of computers in human behavior, technology addiction, data mining, expert systems, computer science education, Internet addiction, Smartphone Addiction, and Video Gaming Disorder. At present, his research delves into interdisciplinary topics related to computer science, higher education, data mining, Internet addiction, screen devices, and smartphone addiction. Prior to the financial crises in Lebanon, he secured 4 consecutive grants from The National Council for Scientific Research Lebanon (CNRS).\nDr. Hawi is a recognized thought leader on digital addiction, having been interviewed by numerous local, regional, and international radio and television programs. He has also been a featured speaker at various educational and non-educational institutions. His contributions extend to published articles in Arabic, English, and French newspapers and websites. His latest appearance on CNBC, USA has accumulated over 3.5 million views.\nAmong his significant achievements, Dr. Hawi is known for publishing the first research on Internet Addiction in the Arab world. He has also developed and validated the first published Digital Addiction Scale for Children globally, translated and validated the Internet Addiction Test and Internet Gaming Disorder scales into Arabic, which have been widely sought after by researchers across at least 15 Arab countries. Additionally, he is credited with coining the terms \"e-discipline\" and \"EM-Factor\" in the context of Internet Addiction.",
    "keywords": ["Nazir Hawi biography", "Full Professor", "Natural and Applied Sciences", "NDU", "Institute of Internet and Technology Addiction", "Board of Directors Chair", "top 2% scientist", "Scopus ranking", "Stanford University", "courses taught", "Advanced Data Science", "Java Programming", "Mobile App Development", "research interests", "technology addiction", "data mining", "Internet addiction", "Smartphone Addiction", "Video Gaming Disorder", "CNRS grants", "digital addiction expert", "media appearances", "CNBC", "Internet Addiction Arab world", "Digital Addiction Scale for Children", "Internet Addiction Test validation", "Internet Gaming Disorder scale", "e-discipline", "EM-Factor"]
  },
  {
    "text": "Hawi, N., & Samaha, M. (2024). Relationships of gaming disorder, ADHD, and academic performance in university students: A mediation analysis. Plos one, 19(4), e0300680.\nHawi, N. S., & Samaha, M. (2023). The Relationship Between Obsessive-Compulsive Disorder and Gaming Disorder, International Journal of Cyber Behavior, Psychology and Learning (IJCBPL), 13(1), 1-15.\nSamaha, M., & Hawi, N.S. (2020). Internet Gaming Disorder and Its Relationships with Student Engagement and Academic Performance, International Journal of Cyber Behavior, Psychology and Learning.\nHawi, N. S., Samaha, M., & Griffiths, M. D. (2019). The Digital addiction scale for children: Development and Validation, Cyberpsychology, Behavior, and Social Networking.\nHawi, N.S., & Samaha, M. (2019). Identifying commonalities and differences of personality characteristics in profiling Internet and social media addictions: Traits, self-esteem, and self-construal, Behaviour & Information Technology.\nHawi, N.S., Samaha, M. & Griffiths, M. D. (2018). Internet gaming disorder in Lebanon: Relationships with age, sleep habits, and academic achievement, Journal of Behavioural Addictions.\nHawi, N.S., & Samaha, M. (2017). Relationships among smartphone addiction, anxiety, and family relations, Behaviour & Information Technology.\nSamaha, M & Hawi, N.S. (2017). Associations between screen media parenting practices and children's screen time in Lebanon, Telematics and informatics, Elsevier. 34.1 (2017): 351-358.\nHawi, N.S., & Samaha, M. (2016). The relations among social media addiction, self-esteem and life satisfaction in university students. Social Science Computer Review. Sage.\nHawi, N.S., & Maya Samaha (2016). To excel or not to excel: Strong evidence on the adverse effect of smartphone addiction on academic performance, Computers & Education, Elsevier. 98, 81-89.\nSamaha, M & Hawi, N.S. (2016). Relationships among smartphone addiction, stress, academic performance, and satisfaction with life, Computers in Human Behavior, Elsevier. 57, 321-325.\nHawi, N.S., Blanchio, A., & Przepiorka, A. (2015). Exploring the Online Cognition Scale in a Polish Sample, Computers in Human Behavior, Elsevier. 51, 470-475.\nHawi, N.S., & Maya Samaha Rupert (2015). Impact of e-Discipline on Children's Screen Time, Cyberpsychology, Behavior, and Social Networking, Mary Ann Liebert, 18(6), 337-342.\nHawi, N.S., Blanchio, A., & Przepiorka, A. (2015). Polish validation of the Internet Addiction Test, Computers in Human Behavior, Elsevier. 48, 548-553.\nHawi, N.S. (2014), Learning programming: A model emerging from data, International Journal of Computer Applications, 100(4), 24-34.\nHawi, N.S. (2013), Knowledge mining from human interactions with the Internet, Global Journal on Technology, 4(1), 486-492.\nHawi, N.S. (2013), Arabic validation of the internet addiction test, Cyberpsychology, Behavior, and Social Networking, Mary Ann Liebert, 16(3), 200-204.\nHawi, N.S. (2012), Internet addiction among adolescents in Lebanon, Computers in Human Behavior, Elsevier, 28(2012), 1044-1053.\nHawi, N.S. (2012), A CAD (classroom assessment design) of a computer programming course, US-China Education Review B, David Publishing, 2(1), 41-49.\nHawi, N.S. (2010), Causal attributions of success and failure made by undergraduate students in an introductory level computer programming course, Computers & Education, Elsevier, 54(4), 1127-1136.\nHawi, N.S. (2010), The exploration of student-centered approaches for the improvement of learning programming in higher education, US-China Education Review, David Publishing, 7(9), 47-57.",
    "keywords": ["Nazir Hawi publications", "peer-reviewed journals", "gaming disorder", "ADHD", "OCD", "Digital addiction scale", "Internet addiction test", "smartphone addiction", "social media addiction", "screen time", "academic performance", "stress", "Online Cognition Scale", "e-discipline", "learning programming", "knowledge mining", "Computer Architecture Design (CAD)", "Causal attributions", "student-centered learning"]
  },
  {
    "text": "Hawi, N.S., & Samaha, M. (October 2017). A spectral clustering approach to determine the relationship between technology use and academic performance. IEEE Jordan Conference on Applied Electrical Engineering and Computing Technologies (AEECT), Aqaba, Jordan\nSamaha, M., & Hawi, N.S. (July 2017). Analysis using spectral clustering to predict Internet gaming behaviours. Proceedings of the the 21st International Database Engineering & Applications Symposium, (IDEAS2017), 12th to 14th of July 2017, Bristol, United Kingdom, pages 1-5, ACM Digital Library.\nHawi, N.S., & Samaha, M. (December, 2016). Effect of technology on the lives of 9-year old children. Proceedings of the 17th International Arab Conference on Information Technology (ACIT'2016), 6th to 8th of December 2016, Beni-Mellal, Morocco.\nHawi, N.S. (2014), Intelligent agent for diagnosis and counseling Internet addicts using Bayesian Networks, Global Journal on Technology, 4(6), 16-20.\nHawi, N.S. (2009). “A classroom assessment design of a computer programming course, The First Regional Conference on Program and Learning Assessment in Higher Education, 6th and 7th of November 2009, The Lebanese American University Center for Program and Learning Assessment, Beirut, Lebanon.\nHawi, N.S. (April, 2013). Knowledge mining from human interactions with the Internet. Proceedings of the 3rd World Conference on Innovation and Computer Science, 26th to 29th of April 2013, Antalya, Turkey.\nHawi, N.S. (September, 2008). Globalization: A Fourth Dimension of Attribution Theory. The BERA Annual Conference 2008, Edinburgh, Scotland.\nHawi, N.S. (July, 2004). An exploration of the application of learner-centered approaches to the improvement of educational practice in an undergraduate language programming course. Proceedings of Directions in Educational Research 2004, Leicester, England.",
    "keywords": ["Nazir Hawi publications", "conference proceedings", "spectral clustering", "technology use", "academic performance", "Internet gaming behaviours", "IDEAS2017", "ACIT'2016", "technology effect on children", "Intelligent agent", "Internet addicts diagnosis", "Bayesian Networks", "classroom assessment design", "learning assessment", "Knowledge mining", "Globalization", "Attribution Theory", "BERA Conference", "learner-centered approaches"]
  },
  {
    "text": "Hawi, N.S. (2021). Screen Time, Screen Time, who is the looser of them all?.\nHawi, N.S. (2020). Children, Technology, and Online Strangers.\nHawi, N.S. (2020). The COVID-19 Outbreak and Screen Time: Allies or Foes.\nHawi, N.S. (2019). The Dangers of Video Game Addiction.",
    "keywords": ["Nazir Hawi publications", "institute articles", "Internet and Technology Addiction Institute", "Screen Time", "Children Technology", "Online Strangers", "COVID-19", "Video Game Addiction"]
  },
  {
    "text": "Hawi, N. S. (1998). Introductory Algebra for Non-Science Students: a Computer Algebra System Approach, United Arab Emirates, Al-Ain: United Arab Emirates University.",
    "keywords": ["Nazir Hawi publications", "book", "Introductory Algebra", "Non-Science Students", "Computer Algebra System Approach", "United Arab Emirates University", "1998"]
  },
  {
    "text": "Hawi, N. S. and Hamdan, R. (1997). Derive: a Mathematical Assistant, United Arab Emirates, Al-Ain: United Arab Emirates University.",
    "keywords": ["Nazir Hawi publications", "manual", "Derive", "Mathematical Assistant", "United Arab Emirates University", "Hamdan R.", "1997"]
  },
  {
    "text": "Lebanese Army Magazine: Interview with journalist Pascale Mouawad titled “ظاهرة تسويق الأولاد من قبل أهلهم على وسائل التواصل الاجتماعي” on March 23, 2022.\nThe Daily Star: “COVID-19 outbreak and screen time: Allies or foes,” April 14, 2020 http://www.dailystar.com.lb/Opinion/Commentary/2020/Apr-14/504364-covid-19-outbreak-and-screen-time-allies-or-foes.ashx\nUNDP News Supplement, Special Edition, The Peace Building in Lebanon, The Dangers of Video Game Addiction, in English, French, and Arabic, Issue no 21, May 2019. http://www.lb.undp.org/content/lebanon/en/home/presscenter/news-letters/2019/PB21/07.html http://www.lb.undp.org/content/lebanon/ar/home/presscenter/news-letters/2019/pb21/07.html\nTayyar.org: المومو ... بين الحقيقة والخيال. March 19, 2019 https://www.tayyar.org/News/Lebanon/272877\nL'Orient LE JOUR: Oui à la technologie, mais avec modération, Samedi 08 décembre 2018 https://www.lorientlejour.com/article/1147343/oui-a-la-technologie-mais-avec-moderation.html\nAnnahar Newspaper: \"التأديب الإلكتروني من الأهل لا يحقق النتائج المرجوة : استخدام الأجهزة الذكية يزداد لدى تلامذة المدارس\". 25-11-2015.\nAnnahar Newspaper: ٢٠ سؤلا لاختبار إدمان الإنترنت باللغة العربية. 23-09-2013.\nAnnahar Newspaper: المراهقون وإدمان الإنترنت في لبنان. 8-06-2012.",
    "keywords": ["Nazir Hawi media", "specialized reports", "Lebanese Army Magazine", "Daily Star", "UNDP News Supplement", "Tayyar.org", "L'Orient LE JOUR", "Annahar Newspaper", "social media", "children marketing", "COVID-19", "screen time", "Video Game Addiction", "Momo challenge", "technology moderation", "e-discipline", "Internet addiction test Arabic", "adolescents Internet addiction"]
  },
  {
    "text": "MBC, Hamsa Program ما هو تأثير التكنولوجيا على المراهقين؟March 31, 2019. https://shahid.mbc.net/ar/shows/68 -همسة-الموسم- -1كليب /clip-355043\nAl-Arabiya, Special Mission, 25 minutes, Technology Addiction, Saturday, April 2, 2016 @9:30pm. Rerun on: Mon Apr 4 at 7:05 pm and Friday April 8 at 9:30 am. http://vid.alarabiya.net/2016/04/02/SpMi0204/SpMi0204__SpMi0204_video.mp4?versionId=9OAnJDkbKNJTHLwsqM34aqAyB9UCC5.J.\nOTV, Agenda, “Negative implications of Technology Addiction,” Thursday, March 03, 2016 @ 7:30. https://www.youtube.com/watch?v=ChNeVRcJVMQ.\nMTV Prime Time News, Interview on E-Discipline @ 8pm, 8 am, 3pm, Nov 4, 2015.\nMTV Prime Time News, Interview on Internet Addiction @ 8pm, 8 am, 3pm, July 7, 2015.",
    "keywords": ["Nazir Hawi media", "TV reports", "MBC Hamsa Program", "Al-Arabiya Special Mission", "OTV Agenda", "MTV Prime Time News", "Technology Addiction", "E-Discipline", "Internet Addiction", "television appearances"]
  },
  {
    "text": "Computers and Education.\nComputers in Human Behavior.\nCyberpsychology, Behavior, and Social Networking.\nStudies in Higher Education.",
    "keywords": ["Nazir Hawi reviewer", "journal reviewer", "Computers and Education", "Computers in Human Behavior", "Cyberpsychology Behavior and Social Networking", "Studies in Higher Education"]
  },
  {
    "text": "Course Teaching Assignments - Spring 2025",
    "keywords": ["course schedule", "teaching assignments", "Spring 2025", "current semester", "faculty courses"]
  },
  {
    "text": "Advanced Data Science (CSC490) - Dr. Nazir Hawi - Monday/Wednesday 10:00-11:15 AM, Room S215",
    "keywords": ["Advanced Data Science", "CSC490", "Nazir Hawi course", "Spring 2025 schedule", "data science class"]
  },
  {
    "text": "Information Presentation and Visualization (CSC443) - Dr. Nazir Hawi - Tuesday/Thursday 1:00-2:15 PM, Room S217",
    "keywords": ["Information Presentation", "Visualization", "CSC443", "Nazir Hawi course", "Spring 2025 schedule"]
  },
  {
    "text": "Web Programming (CSC324) - Dr. Nazir Hawi - Wednesday/Friday 2:30-3:45 PM, Room S210",
    "keywords": ["Web Programming", "CSC324", "Nazir Hawi course", "Spring 2025 schedule", "web development class"]
  },
  {
    "text": "Computer Networks (CSC425) - Dr. Hoda Maalouf - Monday/Wednesday 11:30 AM-12:45 PM, Room S212",
    "keywords": ["Computer Networks", "CSC425", "Hoda Maalouf course", "Spring 2025 schedule", "networking class"]
  },
  {
    "text": "Databases (CSC385) - Dr. Hoda Maalouf - Tuesday/Thursday 10:00-11:15 AM, Room S211",
    "keywords": ["Databases", "CSC385", "Hoda Maalouf course", "Spring 2025 schedule", "database management"]
  },
  {
    "text": "Operating Systems (CSC372) - Dr. Hoda Maalouf - Wednesday/Friday 1:00-2:15 PM, Room S213",
    "keywords": ["Operating Systems", "CSC372", "Hoda Maalouf course", "Spring 2025 schedule", "OS class"]
  },
  {
    "text": "Faculty Office Hours - Spring 2025",
    "keywords": ["office hours", "faculty availability", "Spring 2025", "professor consultation hours", "student meeting times"]
  },
  {
    "text": "Dr. Nazir Hawi Office Hours: Monday 12:00-2:00 PM, Thursday 11:30 AM-1:30 PM, or by appointment. Location: FNAS 1.46",
    "keywords": ["Nazir Hawi office hours", "professor availability", "FNAS 1.46", "faculty consultation", "Spring 2025"]
  },
  {
    "text": "Dr. Hoda Maalouf Office Hours: Tuesday 12:00-2:00 PM, Friday 10:00 AM-12:00 PM, or by appointment. Location: FNAS 1.18",
    "keywords": ["Hoda Maalouf office hours", "professor availability", "FNAS 1.18", "faculty consultation", "Spring 2025"]
  },
  {
    "text": "Meeting Scheduling Procedures",
    "keywords": ["meeting scheduling", "professor appointment", "faculty meeting", "consultation booking", "office visits"]
  },
  {
    "text": "To schedule a meeting with Dr. Nazir Hawi outside of regular office hours, please email nhawi@ndu.edu.lb with your name, ID number, course, and preferred meeting time. Allow 24-48 hours for response. Virtual meetings via Zoom are also available upon request.",
    "keywords": ["schedule meeting Nazir Hawi", "professor appointment", "email booking", "virtual meetings", "Zoom consultation"]
  },
  {
    "text": "To schedule a meeting with Dr. Hoda Maalouf outside of regular office hours, please email hmaalouf@ndu.edu.lb with your name, ID number, course, and 3 preferred time slots. For urgent matters, you may also contact the Department of Computer Science office at ext. 2117. Dr. Maalouf typically responds to meeting requests within 24 hours on weekdays.",
    "keywords": ["schedule meeting Hoda Maalouf", "professor appointment", "email booking", "department contact", "urgent consultation"]
  }
]